# Задание 3.
number = input("Введите число: ")
number_1 = int(number + number)
number_2 = int(number + number + number)
print("Суммачисел n + nn + nnn =",(int(number) + number_1 + number_2))